Revit 2027 API
BuiltInFailures.RoofFailures.RoofMeetsRoofTangentiallyError Property
 The roofs cannot be joined because the roof being joined meets the target roof tangentially.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoofMeetsRoofTangentiallyError { get; }
Public Shared ReadOnly Property RoofMeetsRoofTangentiallyError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoofMeetsRoofTangentiallyError {
	FailureDefinitionId^ get ();
}
static member RoofMeetsRoofTangentiallyError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace